<a href="https://colab.research.google.com/github/Juscarmo/-Minha-Primeira-Stack-AWS/blob/main/Aulas_de_Imers%C3%A3o_de_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Nova seção

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [12]:
df.head()

NameError: name 'df' is not defined

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [ ]:
df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [ ]:
var1, columns = df.shape[0], df.shape[1]
print("linhas:",linhas)
print("colunas:",colunas)

NameError: name 'linhas' is not defined

In [ ]:
df.shape

(133349, 11)

In [ ]:
linhas, colunas = df.shape[0], df.shape[1]
print("linhas:",linhas)
print("colunas:",colunas)

linhas: 133349
colunas: 11

In [ ]:
df.columns

### Traduzindo os nomes das colunas

Primeiro, vamos definir um dicionário de mapeamento para as colunas.

In [ ]:
columns_translation = {
    'work_year': 'ano_de_trabalho',
    'experience_level': 'nivel_de_experiencia',
    'employment_type': 'tipo_de_emprego',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda_do_salario',
    'salary_in_usd': 'salario_em_usd',
    'employee_residence': 'residencia_do_empregado',
    'remote_ratio': 'percentual_remoto',
    'company_location': 'localizacao_da_empresa',
    'company_size': 'tamanho_da_empresa'
}

df = df.rename(columns=columns_translation)

print("Colunas do DataFrame traduzidas:")
display(df.columns)

Colunas do DataFrame traduzidas:

Index(['ano_de_trabalho', 'nivel_de_experiencia', 'tipo_de_emprego', 'cargo',
       'salario', 'moeda_do_salario', 'salario_em_usd',
       'residencia_do_empregado', 'percentual_remoto',
       'localizacao_da_empresa', 'tamanho_da_empresa'],
      dtype='object')

In [ ]:
Index(['ano', 'nivel_de_experiencia', 'tipo_de_emprego', 'cargo',
       'salario', 'moeda_do_salario', 'salario_em_usd',
       'residencia_do_empregado', 'percentual_remoto',
       'localizacao_da_empresa', 'tamanho_da_empresa'],
      dtype='object')

In [ ]:
df['nivel_de_experiencia']. value_counts()

nivel_de_experiencia
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

Agora, vamos visualizar as primeiras linhas do DataFrame com as colunas traduzidas.

In [ ]:
df['tipo_de_emprego'].value_counts()

tipo_de_emprego
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [ ]:
df['salario']. value_counts()

salario
160000     2466
110000     2262
150000     2189
180000     1840
100000     1839
           ...
165220        1
208775        1
1450000       1
1335000       1
19000         1
Name: count, Length: 11234, dtype: int64

In [ ]:
df['localizacao_da_empresa']. value_counts()

localizacao_da_empresa
US    119641
CA      5239
GB      3719
AU       522
NL       404
       ...
IR         1
BS         1
IQ         1
CN         1
MD         1
Name: count, Length: 95, dtype: int64

In [ ]:
df['tamanho_da_empresa']. value_counts()

tamanho_da_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [ ]:
df['salario']. value_counts()

salario
160000     2466
110000     2262
150000     2189
180000     1840
100000     1839
           ...
165220        1
208775        1
1450000       1
1335000       1
19000         1
Name: count, Length: 11234, dtype: int64

In [ ]:
df['percentual_remoto']. value_counts()

percentual_remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [ ]:
df['moeda_do_salario']. value_counts()

moeda_do_salario
USD    126140
GBP      3597
EUR      2602
CAD       548
INR       139
PLN        94
CHF        45
AUD        32
PHP        29
BRL        23
SGD        22
TWD        17
JPY        14
HUF         9
CZK         6
DKK         5
NOK         5
ZAR         5
MXN         4
TRY         4
ILS         3
THB         2
SEK         1
NZD         1
HKD         1
CLP         1
Name: count, dtype: int64

In [ ]:
df['salario_em_usd']. value_counts()

salario_em_usd
160000    2447
110000    2203
150000    2167
180000    1828
100000    1762
          ...
411800       1
598279       1
37069        1
42122        1
69444        1
Name: count, Length: 12421, dtype: int64

In [ ]:
df.head()

,ano_de_trabalho,nivel_de_experiencia,tipo_de_emprego,cargo,salario,moeda_do_salario,salario_em_usd,residencia_do_empregado,percentual_remoto,localizacao_da_empresa,tamanho_da_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [ ]:
df['residencia_do_empregado']. value_counts()

residencia_do_empregado
US    119579
CA      5238
GB      3711
AU       517
NL       404
       ...
KW         1
AS         1
CN         1
IQ         1
JE         1
Name: count, Length: 102, dtype: int64

In [ ]:
df['ano_de_trabalho']. value_counts()

ano_de_trabalho
2024.0    62240
2025.0    60627
2023.0     8521
2022.0     1660
2021.0      216
2020.0       75
Name: count, dtype: int64

### Traduzindo as categorias da coluna 'percentual_remoto'

In [ ]:
remote_translation = {
    0: 'Não remoto',
    50: 'Híbrido',
    100: 'Totalmente remoto'
}

df['percentual_remoto'] = df['percentual_remoto'].map(remote_translation)

print("Categorias da coluna 'percentual_remoto' traduzidas:")
display(df['percentual_remoto'].value_counts())

Categorias da coluna 'percentual_remoto' traduzidas:

percentual_remoto
Não remoto           105312
Totalmente remoto     27718
Híbrido                 319
Name: count, dtype: int64

In [ ]:
df.head()

,ano_de_trabalho,nivel_de_experiencia,tipo_de_emprego,cargo,salario,moeda_do_salario,salario_em_usd,residencia_do_empregado,percentual_remoto,localizacao_da_empresa,tamanho_da_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,Totalmente remoto,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,Totalmente remoto,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,Não remoto,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,Não remoto,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,Não remoto,US,M

In [ ]:
df.describe(include='object')

,nivel_de_experiencia,tipo_de_emprego,cargo,moeda_do_salario,residencia_do_empregado,percentual_remoto,localizacao_da_empresa,tamanho_da_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,SE,FT,Data Scientist,USD,US,Não remoto,US,M
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [ ]:
df.describe()

       ano_de_trabalho       salario  salario_em_usd
count    133339.000000  1.333490e+05   133349.000000
mean       2024.358770  1.632833e+05   157617.272098
std           0.680627  2.173860e+05    74288.363097
min        2020.000000  1.400000e+04    15000.000000
25%        2024.000000  1.060200e+05   106000.000000
50%        2024.000000  1.470000e+05   146206.000000
75%        2025.000000  1.990000e+05   198000.000000
max        2025.000000  3.040000e+07   800000.000000

### 2 aula de Python ##

*   Item da lista
*   Item da lista

In [ ]:
df.head()

NameError: name 'df' is not defined

In [ ]:
df.isnull().sum()

In [ ]:
df.isnull()

In [ ]:
df.head()

In [ ]:
df.isnull().sum()

In [ ]:
df["ano_de_trabalho"].unique()

In [15]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")
df[df.isnull().any(axis=1)]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
5588,NaN,SE,FT,Product Manager,184500,USD,184500,US,0,US,M
59692,NaN,MI,FT,Engineer,110000,USD,110000,DE,0,DE,M
59710,NaN,EN,FT,Data Scientist,208800,USD,208800,US,0,US,M
59759,NaN,SE,FT,Software Engineer,135000,USD,135000,US,0,US,M
59789,NaN,SE,FT,Engineer,112000,USD,112000,US,0,US,M
131000,NaN,SE,FT,Machine Learning Engineer,163800,USD,163800,US,0,US,M
131006,NaN,SE,FT,Data Analytics Manager,204500,USD,204500,US,0,US,M
133054,NaN,EN,FT,Data Scientist,40000,USD,40000,JP,100,MY,L
133281,NaN,MI,FT,Machine Learning Engineer,180000,PLN,46597,PL,100,PL,L
133317,NaN,MI,FT,Data Scientist,130000,USD,130000,US,50,US,L

In [34]:
import numpy as np
import pandas as pd

df_salarios = pd.DataFrame({
    "nome":["Ana","Paula","Davi","Lia","Luiz"],
    "salario":[4000, np.nan, 5000, np.nan, np.nan]
})
df_salarios["salario_medio+"] = df_salarios["salario"].ffill()
# Correção: Calcular a média arredondada e imprimi-la
mean_salario_rounded = df_salarios["salario"].mean().round(2)
print(f"Média do salário (arredondada): {mean_salario_rounded}")
# Correção: Exibir o DataFrame
df_salarios

Média do salário (arredondada): 4500.0

    nome  salario  salario_medio+
0    Ana   4000.0          4000.0
1  Paula      NaN          4000.0
2   Davi   5000.0          5000.0
3    Lia      NaN          5000.0
4   Luiz      NaN          5000.0

In [35]:
df_salarios = pd.DataFrame({
    "nome":["Ana","Paula","Davi","Lia","Luiz"],
    "salario":[4000, np.nan, 5000, np.nan, np.nan]
})
df_salarios["salario_mediano+"] = df_salarios["salario"].ffill()
# Correção: Calcular a média arredondada e imprimi-la
mean_salario_rounded = df_salarios["salario"].mean().round(2)
print(f"Médiano do salário (arredondada): {mean_salario_rounded}")
# Correção: Exibir o DataFrame
df_salarios

Médiano do salário (arredondada): 4500.0

    nome  salario  salario_mediano+
0    Ana   4000.0            4000.0
1  Paula      NaN            4000.0
2   Davi   5000.0            5000.0
3    Lia      NaN            5000.0
4   Luiz      NaN            5000.0

In [42]:
import numpy as np
import pandas as pd

df_temperatura = pd.DataFrame({
    "dia":["segunda","terca","quarta","quinta","sexta"],
    "temperatura":[30, np.nan, np.nan, 28, 27]
})

df_temperatura["Preenchido_ffill"] = df_temperatura["temperatura"].ffill()
df_temperatura

       dia  temperatura  Preenchido_ffill
0  segunda         30.0              30.0
1    terca          NaN              30.0
2   quarta          NaN              30.0
3   quinta         28.0              28.0
4    sexta         27.0              27.0

In [47]:
import numpy as np
import pandas as pd

df_temperatura = pd.DataFrame({
    "dia":["segunda","terca","quarta","quinta","sexta"],
    "temperatura":[30, np.nan, np.nan, 28, 27]
})

df_temperatura["Preenchido_bfill"] = df_temperatura["temperatura"].bfill()
df_temperatura

       dia  temperatura  Preenchido_bfill
0  segunda         30.0              30.0
1    terca          NaN              28.0
2   quarta          NaN              28.0
3   quinta         28.0              28.0
4    sexta         27.0              27.0

In [50]:
import pandas as pd
import numpy as np

df_cidades = pd.DataFrame({
    "nome":["Ana","Paula","Davi","Lia","Luiz"],
    "cidade":["São Paulo","Rio de Janeiro","Belo Horizonte","Porto Alegre", np.nan] # Adicionado np.nan para igualar o tamanho das listas
})

df_cidades["cidade_preenchida"] = df_cidades['cidade'].fillna('Cidade Não Informada') # Corrigido 'fillma' para 'fillna' e aplicada a lógica
df_cidades

    nome          cidade     cidade_preenchida
0    Ana       São Paulo             São Paulo
1  Paula  Rio de Janeiro        Rio de Janeiro
2   Davi  Belo Horizonte        Belo Horizonte
3    Lia    Porto Alegre          Porto Alegre
4   Luiz             NaN  Cidade Não Informada

In [56]:
import pandas as pd

df_limpo = df.copy() # Inicializa df_limpo como uma cópia de df

# Renomeia a coluna 'work_year' para 'ano' e a converte para Int64 (inteiro que aceita nulos)
df_limpo = df_limpo.rename(columns={'work_year': 'ano'})
df_limpo['ano'] = df_limpo['ano'].astype(pd.Int64Dtype())

df_limpo.head()
df_limpo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   ano                 133339 non-null  Int64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: Int64(1), int64(3), object(7)
memory usage: 11.3+ MB

AULA 3 DE PYTHON ALURA#